tap "derailed/k9s"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "smudge/smudge"

brew "awscli"
brew "openssl@3"
brew "git"
brew "gh"
brew "nvm"

brew "tree"
brew "yq"
brew "bat"
brew "fd"
brew "fzf"
brew "smudge/smudge/nightlight"

brew "kubernetes-cli"
brew "kops"
brew "derailed/k9s/k9s"
brew "neovim"

brew "act"
brew "sqlite"
brew "postgresql@15"
brew "redis"
brew "softhsm"

cask "font-fira-code"
cask "ngrok"
cast "aws-vault"
cask "raycast"
cask "warp"
cask "visual-studio-code"
cask "notion-calendar"
cask "iterm2"
cask "zed"

vscode "bierner.markdown-mermaid"
vscode "christian-kohler.path-intellisense"
vscode "circleci.circleci"
vscode "ckolkman.vscode-postgres"
vscode "dawhite.mustache"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme-icons"
vscode "fractalbrew.backticks"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "naumovs.color-highlight"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "premparihar.gotestexplorer"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "sanjulaganepola.github-local-actions"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vitest.explorer"
vscode "vivaxy.vscode-conventional-commits"
vscode "wakatime.vscode-wakatime"
vscode "xabikos.javascriptsnippets"
vscode "zhuangtongfa.material-theme"
