tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "derailed/k9s"
tap "ngrok/ngrok"
tap "smudge/smudge"

brew "awscli"
brew "openssl@3"
brew "git"
brew "gh"
brew "nvm"

brew "tree"
brew "yq"
brew "bat"
brew "fd"
brew "fzf"
brew "smudge/smudge/nightlight"

brew "kubernetes-cli"
brew "kops"
brew "derailed/k9s/k9s"
brew "neovim"

brew "act"
brew "sqlite"
brew "postgresql@15"
brew "redis"
brew "softhsm"

cask "font-fira-code"
cask "ngrok"
cask "aws-vault"
cask "raycast"
cask "warp"
cask "visual-studio-code"
cask "iterm2"
cask "zed"